app/Http/Controllers/LocationController.php

select * from "locations" order by "created_at" desc
---
    public function index(): View
    {
        $locations = Location::latest()->get();

insert into "locations" ("location", "updated_at", "created_at") values ('Bandung', '2024-10-04 03:16:57', '2024-10-04 03:16:57')
---
    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'location' => 'required|min:5',
        ]);

        Location::create([
            'location' => $request->location,
        ]);

select * from "locations" where "locations"."id" = '5' limit 1
---
    public function edit(string $id): View
    {
        $locations = Location::findOrFail($id);

select * from "locations" where "locations"."id" = '6' limit 1
delete from "locations" where "id" = 6
---
    public function destroy($id): RedirectResponse
    {
        $locations = Location::findOrFail($id);

        $locations->delete();