app/Http/Controllers/OwnerController.php

    public function index(): View
    {
        $owners = Owner::latest()->get();
---
select * from "owners" order by "created_at" desc

    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => 'required|min:5',
            'contactInfo' => 'required|min:5'
        ]);

        Owner::create([
            'name' => $request->name,
            'contactInfo' => $request->contactInfo,
        ]);
---
insert into "owners" ("name", "contactInfo", "updated_at", "created_at") values ('PT. Sajira Mahardika', '08373737', '2024-10-04 03:17:10', '2024-10-04 03:17:10')

    public function edit(string $id): View
    {
        $owners = Owner::findOrFail($id);
---
select * from "owners" where "owners"."id" = '1' limit 1

    public function destroy($id)
    {
        $owners = Owner::findOrFail($id);

        $owners->delete();
---
select * from "owners" where "owners"."id" = '3' limit 1
delete from "owners" where "id" = 3