app/Http/Controllers/VehicleController.php

    public function index(): View
    {
        $vehicle    = Vehicle::with("owners","locations")->latest()->get();
---
select * from "owners" order by "created_at" desc
select * from "locations" order by "created_at" desc
select * from "vehicles" order by "created_at" desc

    public function create(): View
    {
        return view('master.vehicles.create', [
            'page_name'=>'Vehicle',
            'section_name'=>'Create',
            'vehicles' => Vehicle::latest()->get(),
            'owners' => Owner::latest()->get(),
            'locations' => Location::latest()->get(),
        ]);
---
select * from "vehicles" order by "created_at" desc
select * from "owners" order by "created_at" desc
select * from "locations" order by "created_at" desc

    public function store(Request $request): RedirectResponse
    {
        // dd($request);
        $request->validate([
            'licensePlate' => 'required',
            'model' => 'required',
            'year' => 'required',
            'status' => 'required',
            'owner_id' => 'required',
            'location_id' => 'required',
        ]);

        // dd($request->all());

        $vehicle = Vehicle::create([
            'licensePlate' => $request->licensePlate,
            'model' => $request->model,
            'year' => $request->year,
            'status' => $request->status,
            'owner_id' => $request->owner_id,
            'location_id' => $request->location_id,
        ]);
---
insert into "vehicles" ("licensePlate", "model", "year", "status", "owner_id", "location_id", "updated_at", "created_at") values ('D 9861 AI', 'BOX', '2023', 'Aset', '1', '1', '2024-10-04 03:23:53', '2024-10-04 03:23:53')